{
  "experience": [
    {
      "company": "Infosys",
      "logo": "/experience2.png",
      "duration": {
        "start": "Aug 2025",
        "end": "Present"
      },
      "position": "System Engineer",
      "location": "Mysore, India",
      "highlights": [
        "Architecting modular backend services using Core Java and DSA, focusing on optimizing execution time and memory complexity for enterprise modules.",
        "Designing and optimizing relational database schemas in HSQL, implementing complex query logic to ensure high-performance data retrieval.",
        "Developing cloud-native solutions on the Salesforce Platform, including custom Apex triggers and automated CRM data modeling for scalable business logic.",
        "Applying enterprise-grade SDLC and Clean Code principles within Agile workflows to reduce technical debt and ensure 99.9% deployment reliability."
      ],
      "skills": [
        "Core Java",
        "DSA",
        "SQL",
        "HSQL",
        "Salesforce",
        "Apex Development",
        "System Design",
        "Agile"
      ]
    },
    {
      "company": "Lightning Technologies",
      "logo": "/experience1.png",
      "duration": {
        "start": "Jan 2025",
        "end": "June 2025"
      },
      "position": "React Intern",
      "location": "Remote (India)",
      "highlights": [
        "Developed 15+ optimized reusable React components using TypeScript and Tailwind CSS, reducing development time by 30% for future features.",
        "Engineered predictable data flow by implementing a robust Redux Toolkit store with 6+ independent state slices across 10+ pages.",
        "Optimized frontend performance using React.memo and useCallback, achieving a 40% improvement in rendering speeds for data-heavy modules.",
        "Integrated 50+ RESTful APIs with advanced error handling and data fetching patterns to ensure seamless frontend-backend synchronization.",
        "Enhanced UI interactivity by implementing Framer Motion animations, contributing to a measurable increase in user engagement."
      ],
      "skills": [
        "TypeScript",
        "React",
        "Redux Toolkit",
        "Tailwind CSS",
        "Framer Motion",
        "REST APIs",
        "Performance Optimization",
        "Jira",
        "Git"
      ]
    }
  ]
}