{
  "projects": [
    {
      "name": "Infybite",
      "description": "High-concurrency multi-tenant system built with Go to digitize enterprise food court operations and inventory tracking.",
      "keyPoints": [
        "Architected a high-performance backend in Go (Gin) featuring 4-level Role-Based Access Control (RBAC) for Admins, Vendors, Managers, and Users.",
        "Engineered real-time state synchronization via WebSockets, allowing zero-latency menu updates and item tracking across multiple locations.",
        "Implemented a secure authentication pipeline using JWT with Refresh Tokens and HttpOnly Cookies to mitigate XSS and CSRF vulnerabilities.",
        "Designed a scalable multi-tenant data model using GORM and MongoDB to manage independent inventory and vendor statuses."
      ],
      "techStack": [
        "Go (Golang)",
        "Gin Gonic",
        "React",
        "MongoDB",
        "WebSockets",
        "GORM",
        "Redux Toolkit",
        "JWT"
      ],
      "githubRepo": "https://github.com/MohdMusaiyab/infybyte",
      "liveSite": "https://infybite.vercel.app/",
      "images": ["/infyOne.png", "/infytwo.png"]
    },
    {
      "name": "Mess-Bazaar",
      "description": "Next.js bidding platform connecting mess contractors with institutions through a competitive tendering system.",
      "keyPoints": [
        "Orchestrated a full-stack tendering platform using Next.js and Prisma, supporting 10+ production-grade pages for institutional bidding workflows.",
        "Engineered real-time WebSocket-based chat and profile management with a 5-point rating system for multiple user roles.",
        "Implemented smooth UI animations using Framer Motion for bidding transitions and interactive elements.",
        "Designed a secure platform with JWT authentication, role-based access control (4+ roles), and a mobile-friendly UI."
      ],
      "techStack": [
        "Next.js",
        "Node.js",
        "NextAuth",
        "Socket.IO",
        "TypeScript",
        "TailwindCSS",
        "Framer Motion",
        "Prisma",
        "PostgreSQL"
      ],
      "githubRepo": "https://github.com/MohdMusaiyab/MessMatch",
      "liveSite": "https://mess-bazaar.vercel.app",
      "images": ["/mess-bazaar1.png", "/mess-bazaar2.png"]
    },
    {
      "name": "Gossipyfy",
      "description": "Anonymous content sharing platform with support for multiple categories, languages, and audio content.",
      "keyPoints": [
        "Developed a voice-first social platform utilizing AWS S3 for scalable, category-based audio uploads and multilingual content handling.",
        "Implemented sophisticated animations using Framer Motion and a responsive UI with Next.js for an engaging user experience.",
        "Built secure and scalable user authentication using NextAuth, supporting both Google OAuth and email-password login.",
        "Optimized media storage infrastructure with AWS S3 to handle large-scale audio content efficiently."
      ],
      "techStack": [
        "PostgreSQL",
        "NextJS",
        "AWS",
        "NextAuth",
        "Prisma",
        "Docker"
      ],
      "githubRepo": "https://github.com/MohdMusaiyab/gossipyfy",
      "liveSite": "https://gossipyfy.vercel.app/",
      "images": ["/gossipyfy1.png", "/gossipyfy2.png"]
    },
    {
      "name": "Canteen Connect",
      "description": "Food Delivery Web/Mobile Application for College Shops and Cafeteria.",
      "keyPoints": [
        "Digitizing the canteen system to reduce wait times, enhancing customer satisfaction during peak hours.",
        "Utilized the MERN stack for the web-based admin panel and Flutter for the mobile user app, ensuring a seamless experience.",
        "Provided admin features for menu, order, and inventory management, along with real-time tracking for users.",
        "Implemented secure user authentication and payment gateways to ensure data privacy and secure transactions."
      ],
      "techStack": [
        "React.JS",
        "Node JS",
        "Express JS",
        "MongoDB",
        "Firebase",
        "Tailwind CSS",
        "Web Socket"
      ],
      "githubRepo": "https://github.com/Canteen-Connect",
      "liveSite": "https://github.com/Canteen-Connect",
      "images": ["/canteen-1.png", "/canteen-2.png"]
    },
    {
      "name": "E-Estate",
      "description": "MERN stack based E-Estate Web Application with advanced search and image management.",
      "keyPoints": [
        "Implemented advanced search filters for properties based on location, price, and amenities, enhancing user satisfaction.",
        "Achieved efficient image storage by leveraging Firebase, reducing MongoDB storage utilization significantly.",
        "Implemented robust authentication protocols to ensure secure user access and data protection.",
        "Integrated Google Sign-In functionality for enhanced user accessibility and secure login."
      ],
      "techStack": [
        "React.JS",
        "Node JS",
        "MongoDB",
        "Express JS",
        "Redux",
        "Tailwind CSS"
      ],
      "githubRepo": "https://github.com/MohdMusaiyab/real-estate",
      "liveSite": "https://e-estate.onrender.com/",
      "images": ["/e-estate1.png", "/e-estate2.png"]
    },
    {
      "name": "E-Commerce Web App",
      "description": "Full-featured MERN stack E-commerce Application with admin and user panels.",
      "keyPoints": [
        "Designed and developed intuitive admin and user panels catering to specific administrative and customer needs.",
        "Implemented a secure payment gateway to facilitate seamless and secure transactions within the application.",
        "Developed advanced search filters and a user-friendly cart system for simplified product discovery.",
        "Implemented robust error-handling mechanisms to manage system errors effectively and enhance reliability."
      ],
      "techStack": [
        "Node JS",
        "React.JS",
        "MongoDB",
        "Express JS",
        "Firebase",
        "Bootstrap"
      ],
      "githubRepo": "https://github.com/MohdMusaiyab/e-commerce-frontend",
      "liveSite": "https://mandmecommerce.onrender.com/",
      "images": ["/e-com1.png", "/e-com2.png"]
    }
  ]
}