{
  "projects": [
    {
      "name": "Mess-Bazaar",
      "description": "Next.js bidding platform connecting mess contractors with institutions through competitive bidding system.",
      "keyPoints": [
        "Built a full-stack bidding platform connecting mess contractors with institutions through competitive bidding system, streamlining food service procurement.",
        "Engineered real-time WebSocket-based chat and profile management with 5-point rating system for multiple user roles.",
        "Implemented smooth UI animations using Framer Motion for bidding transitions and interactive elements.",
        "Designed secure platform with JWT authentication, role-based access control (4+ roles), and mobile-friendly UI."
      ],
      "techStack": [
        "Next.js",
        "Node.js",
        "NextAuth",
        "Socket.IO",
        "TypeScript",
        "TailwindCSS",
        "Framer Motion",
        "Prisma",
        "PostgreSQL"
      ],
      "githubRepo": "https://github.com/MohdMusaiyab/MessMatch",
      "liveSite": "https://mess-bazaar.vercel.app",
      "images": ["/mess-bazaar1.png", "/mess-bazaar2.png"]
    },
    {
      "name": "Gossipyfy",
      "description": "Anonymous content sharing platform with support for multiple categories and languages.",
      "keyPoints": [
        "Developed a platform allowing users to anonymously share media across various categories and languages, enhancing privacy and inclusivity.",
        "Implemented sophisticated animations using Framer Motion and a smooth, responsive UI with Next.js for an engaging user experience.",
        "Built secure and scalable user authentication using NextAuth, supporting both Google OAuth and email-password login.",
        "Optimized media storage infrastructure with AWS S3 to handle large-scale audio content efficiently."
      ],
      "techStack": [
        "PostgreSQL",
        "NextJS",
        "AWS",
        "NextAuth",
        "Prisma",
        "Docker"
      ],
      "githubRepo": "https://github.com/MohdMusaiyab/gossipyfy",
      "liveSite": "https://gossipyfy.vercel.app/",
      "images": ["/gossipyfy1.png", "/gossipyfy2.png"]
    },
    {
      "name": "Canteen Connect",
      "description": "Food Delivery Web/Mobile Application for College Shops and Cafeteria.",
      "keyPoints": [
        "Digitizing the canteen system to reduce wait times, enhancing customer satisfaction during peak hours.",
        "Utilized the MERN stack for the web-based admin panel and Flutter for the mobile user app, ensuring a seamless user experience.",
        "Provided admin features for menu, order, and inventory management, along with order management and tracking for users.",
        "Implemented secure user authentication and payment gateways to ensure data privacy and secure transactions."
      ],
      "techStack": [
        "React.JS",
        "Node JS",
        "Express JS",
        "MongoDB",
        "Firebase",
        "Tailwind CSS",
        "Web Socket"
      ],
      "githubRepo": "https://github.com/Canteen-Connect",
      "liveSite": "https://github.com/Canteen-Connect",
      "images": ["/canteen-1.png", "/canteen-2.png"]
    },
    {
      "name": "E-Estate",
      "description": "MERN stack based E-Estate Web Application.",
      "keyPoints": [
        "Enhanced user satisfaction by implementing advanced search filters, allowing users to refine property searches based on specific criteria such as location, price range, amenities, and property type.",
        "Achieved efficient image storage management by leveraging Firebase's capabilities, resulting in reduced MongoDB storage utilization.",
        "Implemented robust authentication protocols to ensure secure user access and data protection.",
        "Enhanced user accessibility by integrating Google Sign-In functionality, allowing users to log in securely using their Google accounts."
      ],
      "techStack": [
        "React.JS",
        "Node JS",
        "MongoDB",
        "Express JS",
        "Redux",
        "Tailwind CSS"
      ],
      "githubRepo": "https://github.com/MohdMusaiyab/real-estate",
      "liveSite": "https://e-estate.onrender.com/",
      "images": ["/e-estate1.png", "/e-estate2.png"]
    },
    {
      "name": "E-Commerce Web App",
      "description": "MERN stack based E-commerce Web Application.",
      "keyPoints": [
        "Designed and developed intuitive admin and user panels that cater to the specific needs of both administrators and users.",
        "Implemented a secure payment gateway to facilitate seamless and secure transactions within the application.",
        "Developed advanced search filters and a user-friendly cart system, simplifying product discovery and checkout experience.",
        "Implemented robust error-handling mechanisms to detect and manage system errors effectively, enhancing the application's reliability and performance."
      ],
      "techStack": [
        "Node JS",
        "React.JS",
        "MongoDB",
        "Express JS",
        "Firebase",
        "Bootstrap"
      ],
      "githubRepo": "https://github.com/MohdMusaiyab/e-commerce-frontend",
      "liveSite": "https://mandmecommerce.onrender.com/",
      "images": ["/e-com1.png", "/e-com2.png"]
    }
  ]
}
